Repository: gyakkul/SideProject
Catalog: Engine/Plugins/Runtime/HTTPChunkInstaller/Content/Localization/HTTPChunkInstaller/*/HTTPChunkInstaller_FromXLoc.po
Languages: fr, it, ja, ko, pl, ru, zh_hans

# HTTPChunkInstaller,ConnectionFailure
source: Connection to the server failed.
fr: Échec de la connexion au serveur.
it: Connessione al server non riuscita.
ja: サーバーへの接続に失敗しました
ko: 서버 접속에 실패했습니다.
pl: Nie można nawiązać połączenia z serwerem.
ru: Не удалось подключиться к серверу.
zh_hans: 连接服务器失败。

# HTTPChunkInstaller,Diskspace
source: No space on device.
fr: Pas d'espace libre sur le périphérique.
it: Spazio sul dispositivo non disponibile.
ja: デバイスに空き容量がありません
ko: 기기 용량이 부족합니다.
pl: Brak miejsca na urządzeniu.
ru: Недостаточно свободного места.
zh_hans: 存储空间不足。

# HTTPChunkInstaller,EnumerateFilesError_Generic
source: Enumerate Files request failed.
fr: Échec de la demande d'énumération des fichiers.
it: Richiesta elenco file fallita.
ja: ファイル列挙の要求が失敗しました
ko: 파일 열거 요청이 실패했습니다.
pl: Żądanie wyliczenia plików nie powiodło się.
ru: Ошибка запроса перебора файлов.
zh_hans: 枚举文件未响应。

# HTTPChunkInstaller,EnumerateFilesError_UpdateRequired
source: This game requires an update in order to continue playing.
fr: Pour continuer à jouer, vous devez mettre le jeu à jour.
it: Per continuare a giocare è necessario aggiornare il gioco.
ja: このゲームを続行するにはアップデートが必要です
ko: 게임을 계속 진행하려면 업데이트가 필요합니다.
pl: Gra wymaga pobrania aktualizacji, aby kontynuować grę.
ru: Необходимо установить обновление для продолжения игры.
zh_hans: 更新后方可进行游戏。

# HTTPChunkInstaller,HttpResponse
source: HTTP {0} response
fr: Code de réponse HTTP {0}
it: Risposta HTTP {0}
ja: HTTP {0}応答
ko: HTTP {0} 응답
pl: Odpowiedź HTTP: {0}
ru: Ответ HTTP {0}
zh_hans: HTTP {0}响应

# HTTPChunkInstaller,HttpResponseFrom
source: HTTP {0} response from {1}
fr: Réponse HTTP {0} de {1}
it: Risposta HTTP {0} da {1}
ja: {1}からのHTTP {0}応答
ko: {1} 에서 {0} HTTP 반응
pl: Odpowiedź HTTP {0} z: {1}
ru: HTTP-ответ {0} от {1}
zh_hans: HTTP{0}响应来自{1}

# HTTPChunkInstaller,HttpResponseTo
source: Connection to {0} failed
fr: Échec de la connexion à {0}.
it: Impossibile connettersi a {0}
ja: {0}への接続に失敗しました
ko: {0} 연결에 실패했습니다.
pl: {0} – połączenie nieudane
ru: {0}: ошибка подключения
zh_hans: 连接{0}失败

# HTTPChunkInstaller,InstallFailure
source: Failed to install file, retrying...
fr: Échec de l'installation du fichier. Nouvelle tentative...
it: Impossibile installare il file. Nuovo tentativo...
ja: ファイルのインストールに失敗、再試行中…
ko: 파일 설치를 실패했습니다. 재시도중...
pl: Nie udało się zainstalować pliku, ponawianie próby...
ru: Ошибка установки файла. Повторная попытка…
zh_hans: 安装失败，正在重试……

# HTTPChunkInstaller,MissingFile
source: File not found.
fr: Fichier introuvable.
it: File non trovato.
ja: ファイルが見つかりません
ko: 파일을 찾을 수 없습니다.
pl: Nie znaleziono pliku.
ru: Файл не найден.
zh_hans: 未找到文件。

# HTTPChunkInstaller,ParseManifestError_BadFileEntry
source: Bad manifest (invalid file entry).
fr: Manifeste incorrect (entrée de fichier invalide).
it: Errore manifesto (voce file non valida).
ja: 不正なマニフェスト(無効なファイルエントリ)
ko: 파일 목록 나쁨. (유효하지 않은 파일 항목)
pl: Niepoprawny manifest (nieprawidłowy wpis pliku).
ru: Ошибочный манифест (неправильная запись в файле).
zh_hans: 清单损坏（无效文件项）

# HTTPChunkInstaller,ParseManifestError_Json
source: Unable to parse manifest JSON.
fr: Impossible d'analyser le manifeste JSON.
it: Impossibile analizzare il file manifesto JSON.
ja: マニフェストJSONを解析できません
ko: manifest JSON 파일 분석에 실패했습니다.
pl: Nie można odczytać manifestu JSON.
ru: Невозможно проанализировать JSON-манифест.
zh_hans: 无法解析manifest JSON。

# HTTPChunkInstaller,ReadFile_FileNotFound
source: File not found: {0}
fr: Fichier introuvable : {0}
it: File non trovato: {0}
ja: ファイルが見つかりません: {0}
ko: 파일을 찾을 수 없습니다: {0}
pl: Nie znaleziono pliku: {0}
ru: Файл не найден: {0}
zh_hans: 未找到文件：{0}

# HTTPChunkInstaller,ReadFile_RequestFailed
source: Read request failed for file ({0})
fr: Échec de la demande de lecture du fichier ({0}).
it: Richiesta di lettura del file {0} non riuscita
ja: ファイル({0})の読み取り要求が失敗しました
ko: {0} 파일에 대한 읽기 요청 실패
pl: Nieudane żądanie odczytu pliku ({0})
ru: Ошибка запроса на чтение файла ({0})
zh_hans: 因文件({0})读取请求失败

# HTTPChunkInstaller,ReadFiles
source: Failure to download files, retrying...
fr: Échec du téléchargement du fichier. Nouvelle tentative...
it: Scaricamento dei file non riuscito. Nuovo tentativo in corso...
ja: ファイルのダウンロードに失敗、再試行中…
ko: 파일 다운로드 실패, 재시도 중...
pl: Nie udało się pobrać plików, ponawianie próby...
ru: Ошибка загрузки файлов. Повторная попытка…
zh_hans: 文件下载失败，正在重新连接……

# HTTPChunkInstaller,UnknownFailure
source: Unknown Failure, retrying...
fr: Erreur inconnue. Nouvelle tentative...
it: Ragione del fallimento ignota. Nuovo tentativo in corso...
ja: 不明なエラー、再試行中…
ko: 알 수 없는 실패, 재시도 중...
pl: Wystąpił nieznany błąd. Ponawianie próby...
ru: Неизвестная ошибка. Повторная попытка…
zh_hans: 未知错误，正在重试……
